assets/sum-my-subscriptions/ChainOfCommand.iuml
'
' PlantUML happy path diagram within the sum my subscriptions epic
' Please re-generate the image (.png) after updating the code
'
@startuml
Frontend --> Director: "What did I spend more on last month, Amazon or Netflix?"

== "Find tasks from question" ==

' Find list of tasks from initial question TODO: add happy path where there is no question
Director --> TaskAgent: "Give me a list of tasks from this question"
TaskAgent --> LLM: "Split "What did I spend more on last month, Amazon or Netflix?" into up to 5 goals"
LLM --> TaskAgent: "1. get Amazon spending, 2. get Netflix spending, 3. find greater amount"
TaskAgent --> Director: "Returns tasks as array"

== "Solve step 1. get Amazon spending" ==

Director --> Supervisor: "Hello supervisor, solve these tasks for me (in order)"

' Solve step 1. get Amazon spending
Supervisor --> Router: "Find the Agent I should assign this task to"
Router --> LLM: "Determine which agent is best for this task"
LLM: --> Router: "DatastoreAgent"
Router --> Supervisor: "Call DatastoreAgent with prompt 'get Amazon spending'"
Supervisor --> DatastoreAgent: "Find the answer to the following: 'get Amazon spending'"

@enduml
